/*
 RULES:
 Assume value for (seconds, hours, minutes, days, weeks, months or years) is XXXY, Y is last digit, XY is last two digits;
 */

/* Y == 0 OR Y > 4 OR (XY > 10 AND XY < 15); */
"%d days ago" = "%d дней назад";

/* Y > 1 AND Y < 5 AND (XY < 10 OR XY > 20); */
"%d _days ago" = "%d дня назад";

/* Y == 1 AND XY != 11; */
"%d __days ago" = "%d день назад";


/* Y == 0 OR Y > 4 OR (XY > 10 AND XY < 15); */
"%d hours ago" = "%d часов назад";

/* Y > 1 AND Y < 5 AND (XY < 10 OR XY > 20); */
"%d _hours ago" = "%d часа назад";

/* Y == 1 AND XY != 11; */
"%d __hours ago" = "%d час назад";


/* Y == 0 OR Y > 4 OR (XY > 10 AND XY < 15); */
"%d minutes ago" = "%d минут назад";

/* Y > 1 AND Y < 5 AND (XY < 10 OR XY > 20); */
"%d _minutes ago" = "%d минуты назад";

/* Y == 1 AND XY != 11; */
"%d __minutes ago" = "%d минуту назад";


/* Y == 0 OR Y > 4 OR (XY > 10 AND XY < 15); */
"%d months ago" = "%d месяцев назад";

/* Y > 1 AND Y < 5 AND (XY < 10 OR XY > 20); */
"%d _months ago" = "%d месяца назад";

/* Y == 1 AND XY != 11; */
"%d __months ago" = "%d месяц назад";


/* Y == 0 OR Y > 4 OR (XY > 10 AND XY < 15); */
"%d seconds ago" = "%d секунд назад";

/* Y > 1 AND Y < 5 AND (XY < 10 OR XY > 20); */
"%d _seconds ago" = "%d секунды назад";

/* Y == 1 AND XY != 11; */
"%d __seconds ago" = "%d секунду назад";


/* Y == 0 OR Y > 4 OR (XY > 10 AND XY < 15); */
"%d weeks ago" = "%d недель назад";

/* Y > 1 AND Y < 5 AND (XY < 10 OR XY > 20); */
"%d _weeks ago" = "%d недели назад";

/* Y == 1 AND XY != 11; */
"%d __weeks ago" = "%d неделю назад";


/* Y == 0 OR Y > 4 OR (XY > 10 AND XY < 15); */
"%d years ago" = "%d лет назад";

/* Y > 1 AND Y < 5 AND (XY < 10 OR XY > 20); */
"%d _years ago" = "%d года назад";

/* Y == 1 AND XY != 11; */
"%d __years ago" = "%d год назад";


/* No comment provided by engineer. */
"A minute ago" = "Минуту назад";

/* No comment provided by engineer. */
"An hour ago" = "Час назад";

/* No comment provided by engineer. */
"Just now" = "Только что";

/* No comment provided by engineer. */
"Last month" = "Месяц назад";

/* No comment provided by engineer. */
"Last week" = "Неделю назад";

/* No comment provided by engineer. */
"Last year" = "Год назад";

/* No comment provided by engineer. */
"Yesterday" = "Вчера";

/* No comment provided by engineer. */
"1 year ago" = "1 год назад";

/* No comment provided by engineer. */
"1 month ago" = "1 месяц назад";

/* No comment provided by engineer. */
"1 week ago" = "1 неделю назад";

/* No comment provided by engineer. */
"1 day ago" = "1 день назад";

/* No comment provided by engineer. */
"This morning" = "Этим утром";

/* No comment provided by engineer. */
"This afternoon" = "Этим днём";

/* No comment provided by engineer. */
"Today" = "Сегодня";

/* No comment provided by engineer. */
"This week" = "На этой неделе";

/* No comment provided by engineer. */
"This month" = "В этом месяце";

/* No comment provided by engineer. */
"This year" = "В этом году";
